Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP512GM604.h
/* AD1CON2 */
#define _ALTS AD1CON2bits.ALTS
#define _BUFM AD1CON2bits.BUFM
#define _SMPI AD1CON2bits.SMPI
#define _BUFS AD1CON2bits.BUFS
#define _CHPS AD1CON2bits.CHPS
#define _CSCNA AD1CON2bits.CSCNA
#define _VCFG AD1CON2bits.VCFG
#define _SMPI0 AD1CON2bits.SMPI0
#define _SMPI1 AD1CON2bits.SMPI1
#define _SMPI2 AD1CON2bits.SMPI2
#define _SMPI3 AD1CON2bits.SMPI3
#define _SMPI4 AD1CON2bits.SMPI4
#define _CHPS0 AD1CON2bits.CHPS0
#define _CHPS1 AD1CON2bits.CHPS1
#define _VCFG0 AD1CON2bits.VCFG0
#define _VCFG1 AD1CON2bits.VCFG1
#define _VCFG2 AD1CON2bits.VCFG2

/* AD1CON3 */
#define _ADCS AD1CON3bits.ADCS
#define _SAMC AD1CON3bits.SAMC
#define _ADRC AD1CON3bits.ADRC
#define _ADCS0 AD1CON3bits.ADCS0
#define _ADCS1 AD1CON3bits.ADCS1
#define _ADCS2 AD1CON3bits.ADCS2
#define _ADCS3 AD1CON3bits.ADCS3
#define _ADCS4 AD1CON3bits.ADCS4
#define _ADCS5 AD1CON3bits.ADCS5
#define _ADCS6 AD1CON3bits.ADCS6
#define _ADCS7 AD1CON3bits.ADCS7
#define _SAMC0 AD1CON3bits.SAMC0
#define _SAMC1 AD1CON3bits.SAMC1
#define _SAMC2 AD1CON3bits.SAMC2
#define _SAMC3 AD1CON3bits.SAMC3
#define _SAMC4 AD1CON3bits.SAMC4

/* AD1CHS123 */
#define _CH123SA0 AD1CHS123bits.CH123SA0
#define _CH123NA AD1CHS123bits.CH123NA
#define _CH123SA1 AD1CHS123bits.CH123SA1
#define _CH123SA2 AD1CHS123bits.CH123SA2
#define _CH123SB0 AD1CHS123bits.CH123SB0
#define _CH123NB AD1CHS123bits.CH123NB
#define _CH123SB1 AD1CHS123bits.CH123SB1
#define _CH123SB2 AD1CHS123bits.CH123SB2
#define _CH123NA0 AD1CHS123bits.CH123NA0
#define _CH123NA1 AD1CHS123bits.CH123NA1
#define _CH123NB0 AD1CHS123bits.CH123NB0
#define _CH123NB1 AD1CHS123bits.CH123NB1

/* AD1CHS0 */
#define _CH0SA AD1CHS0bits.CH0SA
#define _CH0NA AD1CHS0bits.CH0NA
#define _CH0SB AD1CHS0bits.CH0SB
#define _CH0NB AD1CHS0bits.CH0NB
#define _CH0SA0 AD1CHS0bits.CH0SA0
#define _CH0SA1 AD1CHS0bits.CH0SA1
#define _CH0SA2 AD1CHS0bits.CH0SA2
#define _CH0SA3 AD1CHS0bits.CH0SA3
#define _CH0SA4 AD1CHS0bits.CH0SA4
#define _CH0SB0 AD1CHS0bits.CH0SB0
#define _CH0SB1 AD1CHS0bits.CH0SB1
#define _CH0SB2 AD1CHS0bits.CH0SB2
#define _CH0SB3 AD1CHS0bits.CH0SB3
#define _CH0SB4 AD1CHS0bits.CH0SB4

/* AD1CSSH */
/* Bitname _CSS16 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS17 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS18 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS19 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS20 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS21 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS22 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS23 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS24 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS25 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS26 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS27 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS28 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS29 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS30 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS31 cannot be defined because it is used by more than one SFR */

/* AD1CSSL */
#define _CSS0 AD1CSSLbits.CSS0
#define _CSS1 AD1CSSLbits.CSS1
#define _CSS2 AD1CSSLbits.CSS2
#define _CSS3 AD1CSSLbits.CSS3
#define _CSS4 AD1CSSLbits.CSS4
#define _CSS5 AD1CSSLbits.CSS5
#define _CSS6 AD1CSSLbits.CSS6
#define _CSS7 AD1CSSLbits.CSS7
#define _CSS8 AD1CSSLbits.CSS8
#define _CSS9 AD1CSSLbits.CSS9
#define _CSS10 AD1CSSLbits.CSS10
#define _CSS11 AD1CSSLbits.CSS11
#define _CSS12 AD1CSSLbits.CSS12
#define _CSS13 AD1CSSLbits.CSS13
#define _CSS14 AD1CSSLbits.CSS14
#define _CSS15 AD1CSSLbits.CSS15

/* AD1CON4 */
#define _DMABL AD1CON4bits.DMABL
#define _ADDMAEN AD1CON4bits.ADDMAEN
#define _DMABL0 AD1CON4bits.DMABL0
#define _DMABL1 AD1CON4bits.DMABL1
#define _DMABL2 AD1CON4bits.DMABL2

/* CTMUCON1 */
#define _CTTRIG CTMUCON1bits.CTTRIG
#define _IDISSEN CTMUCON1bits.IDISSEN
#define _EDGSEQEN CTMUCON1bits.EDGSEQEN
#define _EDGEN CTMUCON1bits.EDGEN
#define _TGEN CTMUCON1bits.TGEN
#define _CTMUSIDL CTMUCON1bits.CTMUSIDL
#define _CTMUEN CTMUCON1bits.CTMUEN

/* CTMUCON2 */
#define _EDG2SEL CTMUCON2bits.EDG2SEL
#define _EDG2POL CTMUCON2bits.EDG2POL
#define _EDG2MOD CTMUCON2bits.EDG2MOD
#define _EDG1STAT CTMUCON2bits.EDG1STAT
#define _EDG2STAT CTMUCON2bits.EDG2STAT
#define _EDG1SEL CTMUCON2bits.EDG1SEL
#define _EDG1POL CTMUCON2bits.EDG1POL
#define _EDG1MOD CTMUCON2bits.EDG1MOD
#define _EDG2SEL0 CTMUCON2bits.EDG2SEL0
#define _EDG2SEL1 CTMUCON2bits.EDG2SEL1
#define _EDG2SEL2 CTMUCON2bits.EDG2SEL2
#define _EDG2SEL3 CTMUCON2bits.EDG2SEL3
#define _EDG1SEL0 CTMUCON2bits.EDG1SEL0
#define _EDG1SEL1 CTMUCON2bits.EDG1SEL1
#define _EDG1SEL2 CTMUCON2bits.EDG1SEL2
#define _EDG1SEL3 CTMUCON2bits.EDG1SEL3

/* CTMUICON */
#define _IRNG CTMUICONbits.IRNG
#define _ITRIM CTMUICONbits.ITRIM
#define _IRNG0 CTMUICONbits.IRNG0
#define _IRNG1 CTMUICONbits.IRNG1
#define _ITRIM0 CTMUICONbits.ITRIM0
#define _ITRIM1 CTMUICONbits.ITRIM1
#define _ITRIM2 CTMUICONbits.ITRIM2
#define _ITRIM3 CTMUICONbits.ITRIM3
#define _ITRIM4 CTMUICONbits.ITRIM4
#define _ITRIM5 CTMUICONbits.ITRIM5

/* AD2CON1 */
/* Bitname _DONE cannot be defined because it is used by more than one SFR */
/* Bitname _SAMP cannot be defined because it is used by more than one SFR */
/* Bitname _ASAM cannot be defined because it is used by more than one SFR */
/* Bitname _SIMSAM cannot be defined because it is used by more than one SFR */
/* Bitname _SSRCG cannot be defined because it is used by more than one SFR */
/* Bitname _SSRC cannot be defined because it is used by more than one SFR */
/* Bitname _FORM cannot be defined because it is used by more than one SFR */
/* Bitname _AD12B cannot be defined because it is used by more than one SFR */
/* Bitname _ADDMABM cannot be defined because it is used by more than one SFR */
/* Bitname _ADSIDL cannot be defined because it is used by more than one SFR */
/* Bitname _ADON cannot be defined because it is used by more than one SFR */
/* Bitname _SSRC0 cannot be defined because it is used by more than one SFR */
/* Bitname _SSRC1 cannot be defined because it is used by more than one SFR */
/* Bitname _SSRC2 cannot be defined because it is used by more than one SFR */
/* Bitname _FORM0 cannot be defined because it is used by more than one SFR */
/* Bitname _FORM1 cannot be defined because it is used by more than one SFR */

/* AD2CON2 */
/* Bitname _ALTS cannot be defined because it is used by more than one SFR */
/* Bitname _BUFM cannot be defined because it is used by more than one SFR */
/* Bitname _SMPI cannot be defined because it is used by more than one SFR */
/* Bitname _BUFS cannot be defined because it is used by more than one SFR */
/* Bitname _CHPS cannot be defined because it is used by more than one SFR */
/* Bitname _CSCNA cannot be defined because it is used by more than one SFR */
/* Bitname _VCFG cannot be defined because it is used by more than one SFR */
/* Bitname _SMPI0 cannot be defined because it is used by more than one SFR */
/* Bitname _SMPI1 cannot be defined because it is used by more than one SFR */
/* Bitname _SMPI2 cannot be defined because it is used by more than one SFR */
/* Bitname _SMPI3 cannot be defined because it is used by more than one SFR */
/* Bitname _SMPI4 cannot be defined because it is used by more than one SFR */
/* Bitname _CHPS0 cannot be defined because it is used by more than one SFR */
/* Bitname _CHPS1 cannot be defined because it is used by more than one SFR */
/* Bitname _VCFG0 cannot be defined because it is used by more than one SFR */
/* Bitname _VCFG1 cannot be defined because it is used by more than one SFR */
/* Bitname _VCFG2 cannot be defined because it is used by more than one SFR */

/* AD2CON3 */
/* Bitname _ADCS cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC cannot be defined because it is used by more than one SFR */
/* Bitname _ADRC cannot be defined because it is used by more than one SFR */
/* Bitname _ADCS0 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCS1 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCS2 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCS3 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCS4 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCS5 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCS6 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCS7 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC0 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC1 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC2 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC3 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC4 cannot be defined because it is used by more than one SFR */

/* AD2CHS123 */
/* Bitname _CH123SA0 cannot be defined because it is used by more than one SFR */
/* Bitname _CH123NA cannot be defined because it is used by more than one SFR */
/* Bitname _CH123SA1 cannot be defined because it is used by more than one SFR */
/* Bitname _CH123SA2 cannot be defined because it is used by more than one SFR */
/* Bitname _CH123SB0 cannot be defined because it is used by more than one SFR */
/* Bitname _CH123NB cannot be defined because it is used by more than one SFR */
/* Bitname _CH123SB1 cannot be defined because it is used by more than one SFR */
/* Bitname _CH123SB2 cannot be defined because it is used by more than one SFR */
/* Bitname _CH123NA0 cannot be defined because it is used by more than one SFR */
/* Bitname _CH123NA1 cannot be defined because it is used by more than one SFR */
/* Bitname _CH123NB0 cannot be defined because it is used by more than one SFR */
/* Bitname _CH123NB1 cannot be defined because it is used by more than one SFR */

/* AD2CHS0 */
/* Bitname _CH0SA cannot be defined because it is used by more than one SFR */
/* Bitname _CH0NA cannot be defined because it is used by more than one SFR */
/* Bitname _CH0SB cannot be defined because it is used by more than one SFR */
/* Bitname _CH0NB cannot be defined because it is used by more than one SFR */
/* Bitname _CH0SA0 cannot be defined because it is used by more than one SFR */
/* Bitname _CH0SA1 cannot be defined because it is used by more than one SFR */
/* Bitname _CH0SA2 cannot be defined because it is used by more than one SFR */
/* Bitname _CH0SA3 cannot be defined because it is used by more than one SFR */
/* Bitname _CH0SA4 cannot be defined because it is used by more than one SFR */
/* Bitname _CH0SB0 cannot be defined because it is used by more than one SFR */
/* Bitname _CH0SB1 cannot be defined because it is used by more than one SFR */
/* Bitname _CH0SB2 cannot be defined because it is used by more than one SFR */
/* Bitname _CH0SB3 cannot be defined because it is used by more than one SFR */
/* Bitname _CH0SB4 cannot be defined because it is used by more than one SFR */

