Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP512GM604.h
#define _C2RXOVF2_RXOVF19_POSITION               0x00000003
#define _C2RXOVF2_RXOVF19_MASK                   0x00000008
#define _C2RXOVF2_RXOVF19_LENGTH                 0x00000001

#define _C2RXOVF2_RXOVF20_POSITION               0x00000004
#define _C2RXOVF2_RXOVF20_MASK                   0x00000010
#define _C2RXOVF2_RXOVF20_LENGTH                 0x00000001

#define _C2RXOVF2_RXOVF21_POSITION               0x00000005
#define _C2RXOVF2_RXOVF21_MASK                   0x00000020
#define _C2RXOVF2_RXOVF21_LENGTH                 0x00000001

#define _C2RXOVF2_RXOVF22_POSITION               0x00000006
#define _C2RXOVF2_RXOVF22_MASK                   0x00000040
#define _C2RXOVF2_RXOVF22_LENGTH                 0x00000001

#define _C2RXOVF2_RXOVF23_POSITION               0x00000007
#define _C2RXOVF2_RXOVF23_MASK                   0x00000080
#define _C2RXOVF2_RXOVF23_LENGTH                 0x00000001

#define _C2RXOVF2_RXOVF24_POSITION               0x00000008
#define _C2RXOVF2_RXOVF24_MASK                   0x00000100
#define _C2RXOVF2_RXOVF24_LENGTH                 0x00000001

#define _C2RXOVF2_RXOVF25_POSITION               0x00000009
#define _C2RXOVF2_RXOVF25_MASK                   0x00000200
#define _C2RXOVF2_RXOVF25_LENGTH                 0x00000001

#define _C2RXOVF2_RXOVF26_POSITION               0x0000000A
#define _C2RXOVF2_RXOVF26_MASK                   0x00000400
#define _C2RXOVF2_RXOVF26_LENGTH                 0x00000001

#define _C2RXOVF2_RXOVF27_POSITION               0x0000000B
#define _C2RXOVF2_RXOVF27_MASK                   0x00000800
#define _C2RXOVF2_RXOVF27_LENGTH                 0x00000001

#define _C2RXOVF2_RXOVF28_POSITION               0x0000000C
#define _C2RXOVF2_RXOVF28_MASK                   0x00001000
#define _C2RXOVF2_RXOVF28_LENGTH                 0x00000001

#define _C2RXOVF2_RXOVF29_POSITION               0x0000000D
#define _C2RXOVF2_RXOVF29_MASK                   0x00002000
#define _C2RXOVF2_RXOVF29_LENGTH                 0x00000001

#define _C2RXOVF2_RXOVF30_POSITION               0x0000000E
#define _C2RXOVF2_RXOVF30_MASK                   0x00004000
#define _C2RXOVF2_RXOVF30_LENGTH                 0x00000001

#define _C2RXOVF2_RXOVF31_POSITION               0x0000000F
#define _C2RXOVF2_RXOVF31_MASK                   0x00008000
#define _C2RXOVF2_RXOVF31_LENGTH                 0x00000001

#define _C2RXM0SID_EID16_POSITION                0x00000000
#define _C2RXM0SID_EID16_MASK                    0x00000001
#define _C2RXM0SID_EID16_LENGTH                  0x00000001

#define _C2RXM0SID_EID17_POSITION                0x00000001
#define _C2RXM0SID_EID17_MASK                    0x00000002
#define _C2RXM0SID_EID17_LENGTH                  0x00000001

#define _C2RXM0SID_MIDE_POSITION                 0x00000003
#define _C2RXM0SID_MIDE_MASK                     0x00000008
#define _C2RXM0SID_MIDE_LENGTH                   0x00000001

#define _C2RXM0SID_SID0_POSITION                 0x00000005
#define _C2RXM0SID_SID0_MASK                     0x00000020
#define _C2RXM0SID_SID0_LENGTH                   0x00000001

#define _C2RXM0SID_SID1_POSITION                 0x00000006
#define _C2RXM0SID_SID1_MASK                     0x00000040
#define _C2RXM0SID_SID1_LENGTH                   0x00000001

#define _C2RXM0SID_SID2_POSITION                 0x00000007
#define _C2RXM0SID_SID2_MASK                     0x00000080
#define _C2RXM0SID_SID2_LENGTH                   0x00000001

#define _C2RXM0SID_SID3_POSITION                 0x00000008
#define _C2RXM0SID_SID3_MASK                     0x00000100
#define _C2RXM0SID_SID3_LENGTH                   0x00000001

#define _C2RXM0SID_SID4_POSITION                 0x00000009
#define _C2RXM0SID_SID4_MASK                     0x00000200
#define _C2RXM0SID_SID4_LENGTH                   0x00000001

#define _C2RXM0SID_SID5_POSITION                 0x0000000A
#define _C2RXM0SID_SID5_MASK                     0x00000400
#define _C2RXM0SID_SID5_LENGTH                   0x00000001

#define _C2RXM0SID_SID6_POSITION                 0x0000000B
#define _C2RXM0SID_SID6_MASK                     0x00000800
#define _C2RXM0SID_SID6_LENGTH                   0x00000001

#define _C2RXM0SID_SID7_POSITION                 0x0000000C
#define _C2RXM0SID_SID7_MASK                     0x00001000
#define _C2RXM0SID_SID7_LENGTH                   0x00000001

#define _C2RXM0SID_SID8_POSITION                 0x0000000D
#define _C2RXM0SID_SID8_MASK                     0x00002000
#define _C2RXM0SID_SID8_LENGTH                   0x00000001

#define _C2RXM0SID_SID9_POSITION                 0x0000000E
#define _C2RXM0SID_SID9_MASK                     0x00004000
#define _C2RXM0SID_SID9_LENGTH                   0x00000001

#define _C2RXM0SID_SID10_POSITION                0x0000000F
#define _C2RXM0SID_SID10_MASK                    0x00008000
#define _C2RXM0SID_SID10_LENGTH                  0x00000001

#define _C2RXM0SID_EID_POSITION                  0x00000000
#define _C2RXM0SID_EID_MASK                      0x00000003
#define _C2RXM0SID_EID_LENGTH                    0x00000002

#define _C2RXM0SID_SID_POSITION                  0x00000005
#define _C2RXM0SID_SID_MASK                      0x0000FFE0
#define _C2RXM0SID_SID_LENGTH                    0x0000000B

#define _C2TR01CON_TX0PRI_POSITION               0x00000000
#define _C2TR01CON_TX0PRI_MASK                   0x00000003
#define _C2TR01CON_TX0PRI_LENGTH                 0x00000002

#define _C2TR01CON_RTREN0_POSITION               0x00000002
#define _C2TR01CON_RTREN0_MASK                   0x00000004
#define _C2TR01CON_RTREN0_LENGTH                 0x00000001

#define _C2TR01CON_TXREQ0_POSITION               0x00000003
#define _C2TR01CON_TXREQ0_MASK                   0x00000008
#define _C2TR01CON_TXREQ0_LENGTH                 0x00000001

#define _C2TR01CON_TXERR0_POSITION               0x00000004
#define _C2TR01CON_TXERR0_MASK                   0x00000010
#define _C2TR01CON_TXERR0_LENGTH                 0x00000001

#define _C2TR01CON_TXLARB0_POSITION              0x00000005
#define _C2TR01CON_TXLARB0_MASK                  0x00000020
#define _C2TR01CON_TXLARB0_LENGTH                0x00000001

#define _C2TR01CON_TXABT0_POSITION               0x00000006
#define _C2TR01CON_TXABT0_MASK                   0x00000040
#define _C2TR01CON_TXABT0_LENGTH                 0x00000001

#define _C2TR01CON_TXEN0_POSITION                0x00000007
#define _C2TR01CON_TXEN0_MASK                    0x00000080
#define _C2TR01CON_TXEN0_LENGTH                  0x00000001

#define _C2TR01CON_TX1PRI_POSITION               0x00000008
#define _C2TR01CON_TX1PRI_MASK                   0x00000300
#define _C2TR01CON_TX1PRI_LENGTH                 0x00000002

#define _C2TR01CON_RTREN1_POSITION               0x0000000A
#define _C2TR01CON_RTREN1_MASK                   0x00000400
#define _C2TR01CON_RTREN1_LENGTH                 0x00000001

#define _C2TR01CON_TXREQ1_POSITION               0x0000000B
#define _C2TR01CON_TXREQ1_MASK                   0x00000800
#define _C2TR01CON_TXREQ1_LENGTH                 0x00000001

#define _C2TR01CON_TXERR1_POSITION               0x0000000C
#define _C2TR01CON_TXERR1_MASK                   0x00001000
#define _C2TR01CON_TXERR1_LENGTH                 0x00000001

#define _C2TR01CON_TXLARB1_POSITION              0x0000000D
#define _C2TR01CON_TXLARB1_MASK                  0x00002000
#define _C2TR01CON_TXLARB1_LENGTH                0x00000001

#define _C2TR01CON_TXABT1_POSITION               0x0000000E
#define _C2TR01CON_TXABT1_MASK                   0x00004000
#define _C2TR01CON_TXABT1_LENGTH                 0x00000001

